app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test4"], ["body", "succes"], ["user_id", 6], ["created_at", "2020-12-19 02:45:55.448068"], ["updated_at", "2020-12-19 02:45:55.448068"]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save